import re

court_name_pattern = re.compile("\s+(.*)[ \n]в составе", re.MULTILINE)

defendant_full_name_pattern = re.compile(
        "подсудим[огй]{2,3} (.*)[ ,\r\n]", re.MULTILINE
    )

conviction_patterns = ["ранее судим", "рецидив"]

non_conviction_patterns = ["не судим", "не образующей рецидива", "не имеющий судимости", "не имеющая судимости"]

# patterns to search sentence
sentence_patterns = re.compile("приговорил|П Р И Г О В О Р И Л|П Р И Г ОВ О Р ИЛ", re.IGNORECASE)

postanovlenie_patterns = re.compile("постановил|П О С Т А Н О В И Л|П О С Т АН О В ИЛ", re.IGNORECASE)
sud_shtraf_pattern = re.compile("судебн...штраф.")
ugo_shtraf_pattern = re.compile("наказание в виде штрафа в размере")
raboty_pattern = re.compile("принудительн.. работ|исправительн..работ")

suspended_sentence_patterns = ["условн", " 73 "]

imprisonment_patterns = [
    re.compile("освобожд[её]на? по отбытию срока", re.IGNORECASE),
    re.compile("освобожд[её]на? условно-досрочно", re.IGNORECASE),
    re.compile("освобожд[её]на? из колонии по постановлению", re.IGNORECASE),
]

drugs_mass_patterns = [
        re.compile("\.(.*?)([\d.,]+) (килогр\w+)(.*?)\.", re.IGNORECASE),
        re.compile("\.(.*?)([\d.,]+) (грам\w+)(.*?)\.", re.IGNORECASE),
        re.compile("\.(.*?)([\d.,]+) (гр\.)(.*?)\.", re.IGNORECASE),
    ]

# drugs patterns
drugs_sizes = {
        "гашиш.?.?": [2, 25, 10000],
        "конопл..?": [6, 100, 100000],
        "марихуан..?": [6, 100, 100000],
        "метамфетамин.?.?": [0.3, 2.5, 500],
        "первитин.?.?": [0.3, 2.5, 500],
        "амфетамин.?.?": [0.2, 1, 200],
        "N-диметиламфетамин.?.?": [0.5, 2.5, 500],
        "экстракт.?.? маковой соломы": [1, 5, 500],
        "являющееся производным": [0.05, 0.25, 500],
        "метилендиоксипировалерон.?.?": [0.6, 3.0, 600],
        "пирролидиновалерофенон.?.?": [0.05, 0.25, 500],
        "кокаин.?.?": [0.5, 5, 1500],
        "героин.?.?": [0.5, 2.5, 1000],
        "моноацетилморфин.?.?": [0.5, 2.5, 1000],
        "морфин.?.?": [0.5, 2.5, 500],
        "опий": [1, 25, 5000],
        "маков.. солом.": [20, 500, 100000],
        "ацетилкодеин.?.?": [0.5, 2.5, 1000],
        "метадон.?.?": [0.5, 2.5, 1000],
        "мдма": [0.6, 3.0, 600],
        "мда": [0.6, 3.0, 600],
        "мефедрон.?.?": [0.2, 2.5, 500],
        "производн.?.?. N-метилэфедрона": [0, 2, 1, 200],
        "метилэфедрон.?.?": [0.2, 1, 200],
        "3-meo-mpc": [0.05, 0.25, 500],
        "тетраметилциклопропил.?.?": [0.05, 0.25, 500],
        "2c-b": [0.01, 0.5, 10],
        "масло каннабиса": [0.4, 5, 1000],
        "гашишно..?.? масл..?": [0.4, 5, 1000],
        "jwh": [0.05, 0.25, 500],
        "хинолин": [0.05, 0.25, 500],
        "индол": [0.05, 0.25, 500],
        "карфентанил.?.?": [0.002, 0.01, 2],
        "фентанил.?.?": [0.002, 0.01, 2],
        "метилов...?.? эфир.?.?": [0.05, 0.25, 500],
        "псилоцибин.?.?": [0.05, 0.25, 50],
        "псилоцин.?.?": [0.05, 0.25, 50],
        "дмт": [0.5, 2.5, 500],
        "диметилтриптамин.?.?": [0.5, 2.5, 500],
        "nbome": [0.2, 1.0, 200],
        "доб": [0.01, 0.05, 10],
        "броламфетамин.?.?": [0.01, 0.05, 10],
        "мескалин.?.?": [0.5, 2.5, 500],
        "дезоморфин.?.?": [0.05, 0.25, 10],
    }

drug_clean_dict = {
        "героин.?.?": "Героин",
        "производн.?.?. N-метилэфедрона": "Производное N-метилэфедрона",
        "являющееся производным": "Производное",
        "конопл..?": "Каннабис",
        "амфетамин.?.?": "Амфетамин",
        "метилов...?.? эфир.?.?": "Метиловый эфир",
        "метилэфедрон.?.?": "Метилэфедрон",
        "марихуан..?": "Каннабис",
        "пирролидиновалерофенон.?.?": "Пирролидиновалерофенон",
        "тетраметилциклопропил.?.?": "Тетраметилциклопропил",
        "масло каннабиса": "Конопляное/гашишное масло",
        "дезоморфин.?.?": "Дезоморфин",
        "гашишно..?.? масл..?": "Конопляное/гашишное масло",
        "индол": "Спайс",
        "метамфетамин.?.?": "Метамфетамин",
        "экстракт.?.? маковой соломы": "Экстракт маковой соломы",
        "кокаин.?.?": "Кокаин",
        "маков.. солом.": "Маковая солома",
        "мдма": "МДМА",
        "гашиш.?.?": "Гашиш",
        "метадон.?.?": "Метадон",
        "хинолин": "Спайс",
        "мефедрон.?.?": "Мефедрон",
        "jwh": "JWH",
        "карфентанил.?.?": "Карфентанил",
        "фентанил.?.?": "Фентанил",
        "морфин.?.?": "Морфин",
        "лсд": "ЛСД",
        "конопл..?; марихуан..?": "Каннабис",
        "метилендиоксипировалерон.?.?": "Метилендиоксипировалерон",
        "опий": "Опий",
        "моноацетилморфин.?.?": "Моноацетилморфин",
        "броламфетамин.?.?": "ДОБ",
        "индол; пирролидиновалерофенон.?.?": "Соль",
        "конопл..?; масло каннабиса": "Конопляное/гашишное масло",
        "псилоцибин.?.?": "Псилоцибин",
        "2c-b": "2C-B",
        "первитин.?.?": "Метамфетамин",
        "доб": "ДОБ",
        "ацетилкодеин.?.?": "Ацетилкодеин",
        "дмт": "ДМТ",
        "пирролидиновалерофенон.?.?; индол; метилэфедрон.?.?": "Соль",
        "конопл..?; гашиш.?.?; марихуан..?": "Каннабис",
        "марихуан..?; гашиш.?.?": "Каннабис",
    }

special_regex_cases = {
        r"хинолин-\d": "-хинолин-",
        r"\bдигидрохинолин\b": "-хинолин-",
        r"\bтетрагидроизохинолин\b": "-хинолин-",
        r"\b-индол-\b": "-индол-",
    }

special_regex_sizes = {"-хинолин-": [0.05, 0.25, 500], "-индол-": [0.05, 0.25, 500]}

punishment_patterns = [
    re.compile(
        (
            "виновн[ымой]{2} в совершении(?:.*?)наказание(?:.*?)(один|два|три|четыре|пять|шесть|семь|восемь|девять|десять)(?:.*?)(?:год|лет)"
            "(?:(?:.*?)(один|два|три|четыре|пять|шесть|семь|восемь|девять|десять|одиннадцать|двенадцать)(?:.*?)(?:месяц))?(?:.*?)\."
        ),
        re.IGNORECASE,
    ),
    re.compile(
        "виновн[ымой]{2} в совершении(?:.*?)наказание(?:.*?)(\d\d?)(?:.*?)(?:год|лет)(?:(?:.*?)(\d\d?)(?:.*?)(?:месяц))?(?:.*?)\.",
        re.IGNORECASE,
    ),
]

russian_numbers = [
    "ноль",
    "один",
    "два",
    "три",
    "четыре",
    "пять",
    "шесть",
    "семь",
    "восемь",
    "девять",
    "десять",
    "одиннадцать",
    "двенадцать",
]

drugs_sp = re.compile("вещества:")

special_order_patterns = [
    "317 Уголовно-процессуальн",
    "316 Уголовно-процессуальн",
    "317 УПК",
    "316 УПК",
    "в особом порядке",
    "без проведения судебного разбирательства",
]

extenuating_patterns = [
    re.compile(
        "(?:обстоятельств(?:.*?)смягчающ|смягчающ(?:.*?)обстоятельств)(?:.*?)(?:призна[её]т(?:.*?)учитывает|призна[её]т|учитывает)(?:.*?что |.*?: | )(.*)[\r\n]?",
        re.IGNORECASE,
    ),
    re.compile("(.*суд признает смягчающими обстоятельствами)", re.IGNORECASE),
]

    # паттерны поиска размера
general_drug_size_patterns = {
    "Особо крупный": "в особо крупном размере",
    "Крупный": "в крупном размере",
    "Значительный": "в значительном размере",
}

